[
    "This Form 10-Q contains forward-looking statements. Our actual results could differ materially from those set forth as a result of general economic conditions and changes in the assumptions used in making such forward-looking statements. The following discussion and analysis of our financial condition and results of operations should be read together with the audited financial statements and accompanying notes and the other financial information appearing elsewhere in this report. The analysis set forth below is provided pursuant to applicable Securities and Exchange Commission regulations and is not intended to serve as a basis for projections of future events. Refer also to 'Cautionary Note Regarding Forward Looking Statements' in Item 1 above.",
    "The Company has been inactive since the summer of 2014. The Company has not had any revenues from operations during the last six fiscal years nor any interim period in the current fiscal year for which financial statements are furnished in this Registration or amendments thereto. Therefore, the Company is not able to nor is it required to provide comparative period-to-period analysis of its operations pursuant to Item 303 of Regulation B.",
    "We are currently investigating to acquire a target company or business seeking the perceived advantages of being a publicly held corporation. Our principal business objective for the next 12 months and beyond such time is to become a digital asset and cybersecurity company. DPSM`s purpose is 'to protect digital assets of everyone.' The Company offers various products and services to its target audience in one place to make it convenient and easy for its customers to deal with their digital assets and cybersecurity concerns.",
    "DPSM is headquartered in Australia and aspires to become one stop digital asset and cybersecurity global company.",
    "The Company does not currently engage in any business activities that provide cash flow. The costs of investigating and analyzing business combinations and administering the Company's business for the next 12 months are established to be as follows:",
    " (i) filing of Exchange Act reports, (approximately $25,000) and (ii) costs relating to consummating an acquisition (approximately $10,000) and (iii) General Administrative Expenses (approximately $20,000). ",
    "To the extent that the Company's capital resources are insufficient to meet current or planned operating requirements, the Company will seek additional funds through equity or debt financing, collaborative or other arrangements with corporate partners, licensees or others, and from other sources, which may have the effect of diluting the holdings of existing shareholders. The Company has no current arrangements with respect to, or sources of, such additional financing and the Company does not anticipate that existing shareholders will provide any portion of the Company's future financing requirements. Mr. St-Pierre, the Company's President, and ABRAR Investment Pty Ltd ('ABRAR') the principal shareholder of the Company, would favorably entertain funding, through loans, the corporate expenses for approximately 24 months. Any loans by them would be on an interest-free basis, documented by a promissory note and payable only upon consummation of a business combination transaction. Upon consummation of a business combination, we or the target may reimburse them for any such loans from funds furnished by the target. We have no written agreement with Mr. St-Pierre or with ABRAR to advance any further funds for future operating expense, therefore there is no assurance that such funds from Mr. St-Pierre or ABRAR will be forth coming, if required.",
    "No assurance can be given that additional financing will be available when needed or that such financing will be available on terms acceptable to the Company. If adequate funds are not available, the Company may be required to delay or terminate expenditures for certain of its programs that it would otherwise seek to develop and commercialize. This would have a material adverse effect on the Company. These factors raise substantial doubt about the ability of the Company to continue as a going concern.",
    "The Company may consider a business which has recently commenced operations, is a developing company in need of additional funds for expansion into new products or markets, is seeking to develop a new product or service, or is an established business which may be experiencing financial or operating difficulties and is in need of additional capital. Since the Company does not have any assets or revenues, any capital required for future growth would have to be provided by the target company. In the alternative, a business combination may involve the acquisition of, or merger with, a company which does not need substantial additional capital, but which desires to establish a public trading market for its shares, while avoiding, among other things, the time delays, significant expense, and loss of voting control which may occur in a public offering.",
    "Although our officers and/or or directors have had preliminary contacts or discussions with representative of other entities regarding a business combination with us, no verbal or written commitments have been entered into. Any target business that is selected may be a financially unstable company or an entity in its early stages of development or growth, including entities without established records of sales or earnings. In that event, we will be subject to numerous risks inherent in the business and operations of financially unstable and early stage or potential emerging growth companies. In addition, we may affect a business combination with an entity in an industry characterized by a high level of risk, and, although our management will endeavor to evaluate the risks inherent in a particular target business, there can be no assurance that we will properly ascertain or assess all significant risks.",
    "Our management anticipates that it will likely be able to effect only one business combination, due primarily to our limited financing, and the dilution of interest for present and prospective shareholders, which is likely to occur as a result of our management's plan to offer a controlling interest to a target business in order to achieve a tax-free reorganization. This lack of diversification should be considered a substantial risk in investing in us, because it will not permit us to offset potential losses from one venture against gains from another.",
    "The Company anticipates that the selection of a business combination will be complex and extremely risky. Because of general economic conditions, rapid technological advances being made in some industries and shortages of available capital, our management believes that there are numerous firms seeking even the limited additional capital that we will have and/or the perceived benefits of becoming a publicly traded corporation. Such perceived benefits of becoming a publicly traded corporation include, among other things, facilitating or improving the terms on which additional equity financing may be obtained, providing liquidity for the principals of and investors in a business, creating a means for providing incentive stock options or similar benefits to key employees, and offering greater flexibility in structuring acquisitions, joint ventures and the like through the issuance of stock. Potentially available business combinations may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex.",
    "Sources of Business Opportunities",
    "The Company intends to use various sources in its search for potential business opportunities including its officers and directors, consultants, special advisors, securities broker-dealers, venture capitalists, members of the financial community and others who may present management with unsolicited proposals. Because of the Company's limited capital, it may not be able to retain on a fee basis professional firms specializing in business acquisitions and reorganizations. The Company will most likely have to rely on outside sources, not otherwise associated with the Company that will accept their compensation only after the Company has finalized a successful acquisition or merger. The Company will rely upon the expertise and contacts of such persons, use notices in written publications and personal contacts to find merger and acquisition candidates, the exact number of such contacts are dependent upon the skill and industriousness of the participants and the conditions of the marketplace. To date the Company has not engaged nor entered into any definitive agreements nor understandings regarding retention of any consultant to assist the Company in its search for business opportunities, nor is management presently in a position to actively seek or retain any prospective consultants for these purposes.",
    "The Company does not intend to restrict its search to any specific kind of industry or business. The Company may investigate and ultimately acquire a venture that is in its preliminary or development stage, is already in operation, or in various stages of its corporate existence and development. Management cannot predict at this time the status or nature of any venture in which the Company may participate. A potential venture might need additional capital or merely desire to have its shares publicly traded. The most likely scenario for a possible business arrangement would involve the acquisition of, or merger with, an operating business that does not need additional capital, but which merely desires to establish a public trading market for its shares. Management believes that the Company could provide a potential public vehicle for a private entity interested in becoming a publicly held corporation without the time and expense typically associated with an initial public offering.",
    "Once the Company has identified a particular entity as a potential acquisition or merger candidate, management will seek to determine whether acquisition or merger is warranted or whether further investigation is necessary. Such determination will generally be based on management's knowledge and experience, (limited solely to working history) See 'Item 5. Directors, Executive Officers, Promoters and Control Persons'. Management may elect to engage outside independent consultants to perform preliminary analysis of potential business opportunities. However, because of the Company's limited capital it may not have the necessary funds for a complete and exhaustive investigation of any particular opportunity. Management will not devote full time to finding a merger candidate, will continue to engage in outside unrelated activities, and anticipates devoting no more than an average of five (5) hours weekly to such undertaking.",
    "In evaluating such potential business opportunities, the Company will consider, to the extent relevant to the specific opportunity, several factors including potential benefits to the Company and its shareholders; working capital, financial requirements and availability of additional financing; history of operation, if any; nature of present and expected competition; quality and experience of management; need for further research, development or exploration; potential for growth and expansion; potential for profits; and other factors deemed relevant to the specific opportunity.",
    "Because the Company has not located or identified any specific business opportunity as of the date hereof, there are certain unidentified risks that cannot be adequately expressed prior to the identification of a specific business opportunity. There can be no assurance following consummation of any acquisition or merger that the business venture will develop into a going concern or, if the business is already operating, that it will continue to operate successfully. Many of the potential business opportunities available to the Company may involve new and untested products, processes or market strategies which may not ultimately prove successful.",
    "Form of Potential Acquisition or Merger",
    "Presently the Company cannot predict the manner in which it might participate in a prospective business opportunity. Each separate potential opportunity will be reviewed, and, upon the basis of that review, a suitable legal structure or method of participation will be chosen. The particular manner in which the Company participates in a specific business opportunity will depend upon the nature of that opportunity, the respective needs and desires of the Company and management of the opportunity, and the relative negotiating strength of the parties involved. Actual participation in a business venture may take the form of an asset purchase, lease, joint venture, license, partnership, stock purchase, reorganization, merger or consolidation. The Company may act directly or indirectly through an interest in a partnership, corporation, or other form of organization however, the Company does not intend to participate in opportunities through the purchase of minority stock positions.",
    "Because of the Company's current status of inactivity since 2014 and its concomitant lack of assets and relevant operating history, it is likely that any potential merger or acquisition with another operating business will require substantial dilution to the Company's existing shareholder's interests. There will probably be a change in control of the Company, with the incoming owners of the targeted merger or acquisition candidate taking over control of the Company. Management has not established any guidelines as to the amount of control it will offer to prospective business opportunity candidates, since this issue will depend to a large degree on the economic strength and desirability of each candidate, and the corresponding relative bargaining power of the parties. However, management will endeavor to negotiate the best possible terms for the benefit of the Company's shareholders as the case arises. Management may actively negotiate or otherwise consent to the purchase of any portion of their common stock as a condition to, or in connection with, a proposed merger or acquisition. In such an event, existing shareholders may not be afforded an opportunity to approve or consent to any particular stock buy-out transaction. The payment of any compensation to any director, officer or promoter would never be a condition to which a target company would have to agree to prior to completing a business compensation.",
    "Management does not have any plans to borrow funds to compensate any persons, consultants, or promoters in conjunction with its efforts to find and acquire or merge with another business opportunity. Management does not have any plans to borrow funds to pay compensation to any prospective business opportunity, or shareholders, management, creditors, or other potential parties to the acquisition or merger. In either case, it is unlikely that the Company would be able to borrow significant funds for such purposes from any conventional lending sources. In all probability, a public sale of the Company's securities would also be unfeasible, and management does not contemplate any form of new public offering at this time. In the event that the Company does need to raise capital, it would most likely have to rely on the private sale of its securities. Such a private sale would be limited to persons exempt under the Commissions' Regulation D or other rule, or provision for exemption, if any applies. However, no private sales are contemplated by the Company's management at this time. If a private sale of the Company's securities is deemed appropriate in the future, management will endeavor to acquire funds on the best terms available to the Company. However, there can be no assurance that the Company will be able to obtain funding when and if needed, or that such funding, if available, can be obtained on terms reasonable or acceptable to the Company. The Company does not anticipate using Regulation S promulgated under the Securities Act of 1933 to raise any funds any time within the next year, subject only to its potential applicability after consummation of a merger or acquisition.",
    "In the event of a successful acquisition or merger, a finder's fee, in the form of cash or securities of the Company, may be paid to persons instrumental in facilitating the transaction. The Company has not established any criteria or limits for the determination of a finder's fee, although most likely an appropriate finder's fee will be negotiated between the parties, including the potential business opportunity candidate, based upon economic considerations and reasonable value as estimated and mutually agreed upon at that time. A finder's fee would only be payable upon completion of the proposed acquisition or merger in the normal case, and management does not contemplate any other arrangement at this time. Current management has not in the past used any particular consultants, advisors or finders. Management has not actively undertaken a search for, or retention of, any finder's fee arrangement with any person. It is possible that a potential merger or acquisition candidate would have its own finder's fee arrangement, or other similar business brokerage or investment banking arrangement, whereupon the terms may be governed by a pre-existing contract; in such case, the Company may be limited in its ability to affect the terms of compensation, but most likely the terms would be disclosed and subject to approval pursuant to submission of the proposed transaction to a vote of the Company's shareholders. Management cannot predict any other terms of a finder's fee arrangement at this time. If such a fee arrangement was proposed, independent management and directors would negotiate the best terms available to the Company so as not to compromise the fiduciary duties of the representative in the proposed transaction, and the Company would require that the proposed arrangement would be submitted to the shareholders for prior ratification in an appropriate manner.",
    "In the opinion of management, inflation has not and will not have a material effect on our operations in the immediate future. Management will continue to monitor inflation and evaluate the possible future effects of inflation on our business and operations.",
    "Per SEC regulations, we are required to disclose our off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues, expenses, results of operations, liquidity, capital expenditures, or capital resources that are material to investors. As of July 31, 2020 and March 31, 2021, we have no off-balance sheet arrangements.",
    "In accordance with the guidance for business combinations, we determine whether a transaction or other event is a business combination, which requires that the assets acquired, and liabilities assumed constitute a business. Each business combination is then accounted for by applying the acquisition method. If the assets acquired are not a business, we account for the transaction or other event as an asset acquisition. Under both methods, we recognize the identifiable assets acquired, the liabilities assumed, and any non-controlling interest in the acquired entity. In addition, for transactions that are business combinations, we evaluate the existence of goodwill or a gain from a bargain purchase. We capitalize acquisition-related costs and fees associated with asset acquisitions and immediately expense acquisition-related costs and fees associated with business combinations.",
    "Our discussion and analysis of our financial condition and results of operations is based upon our financial statements, which have been prepared in accordance with U.S. Generally Accepted Accounting Principles ('GAAP'). The preparation of these financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, and the related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates.",
    "An accounting policy is considered to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, and if different estimates that reasonably could have been used, or changes in the accounting estimate that are reasonably likely to occur, could materially impact the financial statements. We believe that the following critical accounting policies reflect the more significant estimates and assumptions used in the preparation of the financial statements.",
    "The Company follows the asset and liability method of accounting for future income taxes. Under this method, future income tax assets and liabilities are recorded based on temporary differences between the carrying amount of assets and liabilities and their corresponding tax basis. In addition, the future benefits of income tax assets including unused tax losses, are recognized, subject to a valuation allowance to the extent that it is more likely than not that such future benefits will ultimately be realized. Future income tax assets and liabilities are measured using enacted tax rates and laws expected to apply when the tax liabilities or assets are to be either settled or realized. The Company's effective tax rate approximates the Federal statutory rates.",
    "Comparison of the three months ended March 31, 2021 and 2020",
    "For the three months ended March 31, 2021 and 2020, the Company had no revenues.",
    "During the three months ended March 31, 2021 and 2020, the Company incurred consulting expense of $3,750 and $0, respectively; professional fees of $27,962 and $5,323, respectively; general and administrative expenses of $2,197 and $0, respectively and amortization expense of $284 and $0, respectively.",
    "The increase in operating expenses from 2020 to 2021 is primarily the result of changing the reporting structure of the Company. It changed from alternative reporting to the full reporting. This change increased all expenses in order to fulfill the statutory obligations.",
    "During the three months ended March 31, 2021 and 2020 the Company recognized net loss of $34,193 and $5,323, respectively.",
    "Comparison of the eight months ended March 31, 2021 and 2020",
    "For the eight months ended March 31, 2021 and 2020, the Company had no revenues.",
    "During the eight months ended March 31, 2021 and 2020, the Company incurred consulting expense of $140,000 and $0, respectively; professional fees of $31,968 and $14,283, respectively; general and administrative expenses of $3,447 and $0, respectively and amortization expense of $284 and $0, respectively. The increase in consulting expense from 2020 to 2021 is primarily the result of the issuance of stock to the Company's officer/director for $135,000 in services rendered during 2020.",
    "During the eight months ended March 31, 2021 and 2020 the Company recognized net loss of $175,699 and $14,283, respectively, based on the factors discussed above.",
    "Liquidity and Capital Resources",
    "As of March 31, 2021 and July 31, 2020, the Company had working capital of $198,805 and working capital deficit of $19,155, respectively. The deficit is attributable to loans due to a related party of $18,655 and accounts payable of $500 at July 31, 2020. As of March 31, 2021 and July 31, 2020, the Company had $388,811 and $0 in current assets, respectively.",
    "As of March 31, 2021 and July 31, 2020, we had a cash and equivalents balance of $ 376,311 and $0, respectively. Due to the lack of revenue, the Company's operations are primarily funded by the Company's principal shareholder and proceeds received from the sale of common stock in private placements. The funds are being held in trust with ABRAR Investments Pty ltd, that is the major shareholder of the Company, as 3D Pioneer Systems, Inc. currently has no bank account. The intent is to establish a bank account in the USA. However, the US banks require that the Directors and Officers personally go to the bank to complete the identification process. COVID has made it impossible to do this process now. Australia has placed travel bans for citizens and residents to travel overseas. We expect that will be removed by June 2021, at which point we will proceed with opening a US bank account.",
    "Cash Flows from Operating Activities",
    "Net cash used in operating activities was $34,059 for the eight months ended March 31, 2021 compared with net cash used in operating activities of $12,323 for the eight months ended March 31, 2020. During the eight months ended March 31, 2021, the net cash used in operating activities was attributed to net loss of $175,699, offset by common stock issued for services of $135,000, an increase in accounts payable of $6,356 and amortization expense of $284. During the eight months ended March 31, 2020, the net cash used in operating activities was attributed to net loss of $14,283, offset by $3,960 in expenses paid by a related party, a decrease in accounts payable of $2,000.",
    "Cash Flows from Investing Activities",
    "Net cash used in investing activities was $12,500 for the eight months ended March 31, 2021 compared with net cash used in operating activities of $0 for the eight months ended March 31, 2020.",
    "During the eight months ended March 31, 2021, the net cash used in investing activities was attributed to the payment advanced to third party of $12,500.",
    "Cash Flow from Financing Activities",
    "We generated cash in financing activities during the eight months ended March 31, 2021 and 2020 of $422,870 and $12,323, respectively, from issuance of common stock in the amount of $408,720 and $0 respectively, proceeds from stock subscription payable in the amount of $9,850 and$0, respectively, loans from a related party in the amount of $4,300 and $12,323, respectively.",
    "Non-Cash Investing and Financing Activities",
    "During the eight months ended March 31, 2020, we issued preferred stock valued at $540 for settlement of $3,960 in related party debt. The remaining debt balance of $3,420 was forgiven and recorded to additional paid in capital.",
    "During the eight months ended March 31, 2021, the related party debt in the amount of $ 22,155 was forgiven and recorded to additional paid in capital.",
    "The accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As shown in the accompanying financial statements, we have not generated any revenues, have incurred net losses of $175,699 and $14,283 for the eight months ended March 31, 2021 and 2020, respectively, and have a working capital of $198,805 and a working capital deficit of $19,155 as of March 31, 2021 and July 31, 2020, respectively, which raise substantially the Company's ability to continue as a going concern.",
    "Management believes the Company will continue to incur losses and negative cash flows from operating activities for the foreseeable future and will need additional equity or debt financing to sustain its operations until it can achieve profitability and positive cash flows, if ever. Management plans to seek additional debt and/or equity financing for the Company but cannot assure that such financing will be available on acceptable terms.",
    "The Company's continuation as a going concern is dependent upon its ability to ultimately attain profitable operations, generate sufficient cash flow to meet its obligations, and obtain additional financing as may be required. Our auditors have included a 'going concern' qualification in their Report of Independent Certified Public Accountants accompanying our audited financial statements appearing elsewhere herein which cites substantial doubt about our ability to continue as a going concern. Such a 'going concern' qualification may make it more difficult for us to raise funds when needed. The outcome of this uncertainty cannot be assured.",
    "The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty. There can be no assurance that management will be successful in implementing its business plan or that the successful implementation of such business plan will actually improve our operating results."
]